//二维数组
/*
int  a[2][3]={{1,2,3},{4,5,6}};
a[0][0]=1;
a[0][1]=2;
a[0][2]=3;
a[1][0]=4;
a[1][1]=5;
a[1][2]=6;
int a[2][3]={1,2,3,4,5,6};
*/

////将一个二维数组a=[1 2 3]的行列元素互换，存到另一个二维数组B中并输出 
////				  [4 5 6]
//#include <stdio.h>
//int main()
//{
//	int a[2][3]={{1,2,3},{4,5,6}};
//	int b[3][2],i,j;
//	
//	for(i=0;i<=1;i++)
//	{
//		for(j=0;j<=2;j++)
//		{
//			b[j][i]=a[i][j];
//		}
//	}
//	
//	printf("数组b为：\n");
//	for(j=0;j<=2;j++)
//	{
//		for(i=0;i<=1;i++)
//		{
//			printf("%d\t",b[j][i]);
//			printf("\n");
//		}
//	}
//	return 0;
//}

//已知矩阵a=[1   2   3]请编程求出其中值最大的那个元素。 
//		    [9   8   7]
//		    [-10 10 -5] 
#include <stdio.h>
int main()
{
	int a[3][3]={1,2,3,9,8,7,-10,10,-5};
	int i,j,max;
	
	max = a[0][0];
	for(i=0;i<=2;i++)
	{
		for(j=0;j<=2;j++)
		{
			if (a[i][j]> max )
			{
				max = a[i][j];
			}
		}
	}
	
	printf("最大的元素为：%d\n",max);

	return 0;
}





















 
